; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   sinkbasintype microwavetype fridgetype - receptacletype
   butterknifetype knifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   sidetabletype carttype safetype toastertype laundryhampertype - receptacletype
   pottype toiletpaperrolltype forktype saltshakertype potatotype basketballtype boxtype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 location6 location7 location8 - location
   sidetable_1 cart_2 safe_3 cart_4 toaster_5 laundryhamper_6 sidetable_7 sidetable_8 microwave_9 fridge_10 - receptacle
   pot_1 toiletpaperroll_2 fork_3 pot_4 saltshaker_5 potato_6 basketball_7 box_8 - obj
 )
 (:init (receptacletype_0 sidetable_1 sidetabletype) (receptacletype_0 cart_2 carttype) (receptacletype_0 safe_3 safetype) (receptacletype_0 cart_4 carttype) (receptacletype_0 toaster_5 toastertype) (receptacletype_0 laundryhamper_6 laundryhampertype) (receptacletype_0 sidetable_7 sidetabletype) (receptacletype_0 sidetable_8 sidetabletype) (receptacletype_0 microwave_9 microwavetype) (receptacletype_0 fridge_10 fridgetype) (objecttype_0 pot_1 pottype) (objecttype_0 toiletpaperroll_2 toiletpaperrolltype) (objecttype_0 fork_3 forktype) (objecttype_0 pot_4 pottype) (objecttype_0 saltshaker_5 saltshakertype) (objecttype_0 potato_6 potatotype) (objecttype_0 basketball_7 basketballtype) (objecttype_0 box_8 boxtype) (cancontain sidetabletype pottype) (cancontain sidetabletype toiletpaperrolltype) (cancontain sidetabletype forktype) (cancontain sidetabletype saltshakertype) (cancontain sidetabletype potatotype) (cancontain sidetabletype basketballtype) (cancontain sidetabletype boxtype) (cancontain carttype toiletpaperrolltype) (cancontain microwavetype potatotype) (cancontain fridgetype pottype) (cancontain fridgetype potatotype) (pickupable pot_1) (isreceptacleobject pot_1) (cleanable pot_1) (coolable pot_1) (pickupable toiletpaperroll_2) (pickupable fork_3) (cleanable fork_3) (pickupable pot_4) (isreceptacleobject pot_4) (cleanable pot_4) (coolable pot_4) (pickupable saltshaker_5) (pickupable potato_6) (cleanable potato_6) (heatable potato_6) (coolable potato_6) (sliceable potato_6) (pickupable basketball_7) (pickupable box_8) (isreceptacleobject box_8) (receptacleatlocation sidetable_1 location2) (receptacleatlocation cart_2 location1) (receptacleatlocation safe_3 location7) (receptacleatlocation cart_4 location8) (receptacleatlocation toaster_5 location3) (receptacleatlocation laundryhamper_6 location1) (receptacleatlocation sidetable_7 location2) (receptacleatlocation sidetable_8 location1) (receptacleatlocation microwave_9 location1) (receptacleatlocation fridge_10 location4) (inreceptacle pot_1 fridge_10) (inreceptacle toiletpaperroll_2 sidetable_1) (inreceptacle fork_3 sidetable_8) (inreceptacle pot_4 sidetable_8) (inreceptacle saltshaker_5 sidetable_8) (inreceptacle potato_6 sidetable_1) (inreceptacle basketball_7 sidetable_8) (inreceptacle box_8 sidetable_7) (objectatlocation pot_1 location4) (objectatlocation toiletpaperroll_2 location2) (objectatlocation fork_3 location1) (objectatlocation pot_4 location1) (objectatlocation saltshaker_5 location1) (objectatlocation potato_6 location2) (objectatlocation basketball_7 location1) (objectatlocation box_8 location2) (atlocation agent1 location2) (= (total-cost) 0))
 (:goal (and (exists (?r_0 - receptacle)
 (exists (?o1 - obj)
 (and (inreceptacle ?o1 ?r_0) (objecttype_0 ?o1 potatotype) (receptacletype_0 ?r_0 sidetabletype) (exists (?o2 - obj)
 (and (not (= ?o1 ?o2)) (objecttype_0 ?o2 forktype) (receptacletype_0 ?r_0 sidetabletype) (inreceptacle ?o2 ?r_0))))))))
 (:constraints (sometime (atlocation agent1 location1)) (sometime-before (atlocation agent1 location1) (or (atlocation agent1 location4) (checked cart_2))))
 (:metric minimize (total-cost))
)

; plan
1. (pickupobject agent1 location2 potato_6 sidetable_1)
   deleted: (inreceptacle potato_6 sidetable_1) (objectatlocation potato_6 location2)
   added: (holds agent1 potato_6) (holdsany agent1)
   goals met: 0 of 1
2. (gotolocation agent1 location2 location4)
   deleted: (atlocation agent1 location2)
   added: (atlocation agent1 location4)
   goals met: 0 of 1
3. (gotolocation agent1 location4 location1)
   deleted: (atlocation agent1 location4)
   added: (atlocation agent1 location1)
   goals met: 0 of 1
4. (putobject agent1 location1 potato_6 sidetable_8 potatotype sidetabletype)
   deleted: (holds agent1 potato_6) (holdsany agent1)
   added: (inreceptacle potato_6 sidetable_8) (objectatlocation potato_6 location1)
   goals met: 1 of 1
